xiaozuxiangmuceshi/advanced/frontend/controllers/HomeController.php

SELECT `c_field`, `founder`, `c_stage`, `c_size` FROM `detail` LIMIT 2
SELECT `c_logo`, `c_introduce`, `c_name` FROM `detail` LIMIT 5
---
    public function actionLogin(){
        $db=\Yii::$app->db;
        $dwb = new \yii\db\Query();
        $aaa=$dwb->select('c_field,founder,c_stage,c_size')->from('detail')->limit(2)->all();
        $aa=$dwb->select('c_logo,c_introduce,c_name')->from('detail')->limit(5)->all();

SELECT `id`, `name`, `pid` FROM `jobtype`
---
    public function get_cat_array($pid = 0) {
       // $db=\Yii::$app->db;
       // $category=$db->createCommand("select * from jobtype")->queryAll();
        $category=(new \yii\db\Query())->select(['id','name','pid'])->from('jobtype')->all();

INSERT INTO `superadmin` (`semail`, `sname`, `spwd`, `register_time`, `register_type`) VALUES ('1312950784@qq.com', 'ç”°é‡‘åˆ\š', 'LmVJ9gs0K7wdoLHfDfQlDrKVVSfbtmTN8hA2v2ETrFK5i4X2m4Rz/uiLDfHf7PIHgtmnhNtN7D5nWqEbHX3x0woBXcWDb1XaCijTnozZ3n5Ku/evDaX3RMXRiaFfRAGLowT4U6vIxvU+DeODhBSjxklRZ6mxspyRtkOCy0hZrm8=', '2016-10-21 14:52:59', '0')
---
            }
            else{
               // file_put_contents('./'.md5($sname).'.txt',$encryptData);
                $re=  $connection->createCommand()->insert('superadmin', [
                    'semail' => $data,
                    'sname'=>$sname,
                    'spwd' => $re,
                    'register_time'=>$time,
                    'register_type'=>$type,
                ])->execute();